In [44]:
import pandas as pd

## CSV files

Reading csv file

In [45]:
df = pd.read_csv('example.csv')

In [46]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

Writing to csv file.

In [47]:
## By default index=true. So a column of index will also be created.
df.to_csv('My_output1.csv')

In [48]:
pd.read_csv('My_output1.csv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [49]:
df.to_csv('My_output2.csv', index=False)

In [50]:
pd.read_csv('My_output2.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## Exel files

Note: pandas can't read images, formulas or macros from exel and might throw error. It can only read normal data.

In [51]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [52]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet', index=False)

In [53]:
pd.read_excel('Excel_Sample2.xlsx')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## HTML files

In [54]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [55]:
data

[                             Bank Name           City  ST   CERT  \
 0                 The First State Bank  Barboursville  WV  14361
 1                   Ericson State Bank        Ericson  NE  18265
 2     City National Bank of New Jersey         Newark  NJ  21111
 3                        Resolute Bank         Maumee  OH  58317
 4                Louisa Community Bank         Louisa  KY  58112
 ..                                 ...            ...  ..    ...
 556                 Superior Bank, FSB       Hinsdale  IL  32646
 557                Malta National Bank          Malta  OH   6629
 558    First Alliance Bank & Trust Co.     Manchester  NH  34264
 559  National State Bank of Metropolis     Metropolis  IL   3815
 560                   Bank of Honolulu       Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                         MVB Bank, Inc.      April 3, 2020
 1             Farmers and Merchants Bank  February 14, 2020
 2                        Industrial Bank   November 1, 2019
 3                     Buckeye State Bank   October 25, 2019
 4      Kentucky Farmers Bank Corporation   October 25, 2019
 ..                                   ...                ...
 556                Superior Federal, FSB      July 27, 2001
 557                    North Valley Bank        May 3, 2001
 558  Southern New Hampshire Bank & Trust   February 2, 2001
 559              Banterra Bank of Marion  December 14, 2000
 560                   Bank of the Orient   October 13, 2000

 [561 rows x 6 columns]]

## SQL data

creating a temporary engine to read sqlite data. Using a dedicated sql engine depending on the flavor of sql in advised

In [62]:
from sqlalchemy import create_engine

In [66]:
engine = create_engine('sqlite:///:memory:')

In [70]:
df.to_sql('my_table', index=False, engine)

SyntaxError: positional argument follows keyword argument (<ipython-input-70-5d39edc6103b>, line 1)

In [68]:
sqldf = pd.read_sql('my_table', con=engine)

In [69]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15